views/concept/index.php

SELECT * FROM `feedback` WHERE (`user_id`=12) AND (`concept_id`=3)
---
        <div class="concept-list">
            <?php foreach ($concepts as $concept): ?>
                <?php
                $userFeedback = Feedback::findOne(['user_id' => Yii::$app->user->id, 'concept_id' => $concept->id]);

SELECT COUNT(*) FROM `feedback` WHERE (`status`='understood') AND (`concept_id`=3)
---

                                    <br>
                                    <?php
                                    $understoodCount = $concept->getFeedbacks()->where(['status' => 'understood'])->count();

SELECT COUNT(*) FROM `feedback` WHERE (`status`='not_understood') AND (`concept_id`=3)
---

                                    <br>
                                    <?php
                                    $notUnderstoodCount = $concept->getFeedbacks()->where(['status' => 'not_understood'])->count();