controllers/ConceptController.php

SELECT * FROM `concept`
---
    public function actionIndex()
    {
        $concepts = Concept::find()->all();

SELECT EXISTS(SELECT * FROM `user` WHERE `user`.`id`=12)
SELECT * FROM `feedback` WHERE (`user_id`=12) AND (`concept_id`='4')
INSERT INTO `feedback` (`user_id`, `concept_id`, `status`, `created_at`) VALUES (12, 4, 'not_understood', NOW())
---
    public function actionSubmitFeedback($concept_id, $status)
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }

        $userId = Yii::$app->user->id;

        // Validate status
        if (!in_array($status, ['understood', 'not_understood'])) {
            Yii::$app->session->setFlash('error', 'Invalid feedback status.');
            return $this->redirect(['index']);
        }

        // Find existing feedback or create a new one
        $feedback = Feedback::findOne(['user_id' => $userId, 'concept_id' => $concept_id]);
        if ($feedback === null) {
            $feedback = new Feedback();
            $feedback->user_id = $userId;
            $feedback->concept_id = $concept_id;
        }

        $feedback->status = $status;

        if ($feedback->save()) {

SELECT * FROM `feedback` WHERE (`user_id`=12) AND (`concept_id`='4')
DELETE FROM `feedback` WHERE `id`=10
---
    public function actionRemoveFeedback($concept_id)
    {
        if (Yii::$app->user->isGuest) {
            return $this->redirect(['site/login']);
        }

        $userId = Yii::$app->user->id;
        $feedback = Feedback::findOne(['user_id' => $userId, 'concept_id' => $concept_id]);
        if ($feedback) {
            $feedback->delete();

SELECT * FROM `concept` WHERE `id`='3'
SELECT * FROM `feedback` WHERE (`concept_id`='3') AND (`status`='understood')
---
    public function actionViewFeedback($id, $status)
    {
        $concept = Concept::findOne($id);
        if (!$concept) {
            throw new NotFoundHttpException('Concept not found.');
        }

        if ($status === 'not_understood' && (!Yii::$app->user->identity || !Yii::$app->user->identity->isAdmin())) {
            throw new ForbiddenHttpException('Only admins can view the list of students who did not understand.');
        }

        $feedbacks = Feedback::find()->where(['concept_id' => $id, 'status' => $status])->all();

SELECT * FROM `concept` WHERE `id` IN (3, 4, 5)
SELECT * FROM `feedback` WHERE `user_id`=12
---
    public function actionMyReport()
    {
        $feedbacks = Feedback::find()
            ->where(['user_id' => Yii::$app->user->id])
            ->with('concept')
            ->all();

SELECT * FROM `concept` WHERE `id` IN (3, 4, 5)
SELECT * FROM `feedback` WHERE `user_id`=12
---
    public function actionMyReportPdf()
    {
        $feedbacks = Feedback::find()
            ->where(['user_id' => Yii::$app->user->id])
            ->with('concept')
            ->all();