controllers/SiteController.php

    public function actionRegister()
    {
        $model = new User(['scenario' => 'register']);
        $errors = [];

        if (Yii::$app->request->isPost) {
            $model->load(Yii::$app->request->post());
            $model->email = $model->username . '@example.com'; // Auto-generate email
            $model->role = 'student';

            if ($model->save()) {
---
INSERT INTO `user` (`username`, `contact_number`, `email`, `role`, `auth_key`, `status`, `password_hash`) VALUES ('VICTORIA', '0748716585', 'VICTORIA@example.com', 'student', 'RpbkqRYQevduLuFn_NXwR9qtI9S3ZM-t', 10, '$2y$13$TJvK/s9YQeXqNBv.PO6D7Ot0Ncu9T3OQb0ItAYAc93cI8XG1mnJRm')