models/User.php

    public static function findIdentity($id)
    {
        return static::findOne(['id' => $id, 'status' => 10]);
---
SELECT * FROM `user` WHERE (`id`=12) AND (`status`=10)

    public static function findByUsername($username)
    {
        return static::findOne(['username' => $username, 'status' => 10]);
---
SELECT * FROM `user` WHERE (`username`='IMASHA') AND (`status`=10)